Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/gpio/netmf_gpio.cpp
static BOOL IsOutputPin(GPIO_PIN Pin)
{
	GPIO_TypeDef *port;
	unsigned int p;
	unsigned int mode;
	unsigned int mode_mask = 0x03;
	BOOL isOutput;

	if (Pin > GPIO_PINS) { return FALSE; }

	port = GPIO_GetPortPtr(Pin);
	p = GPIO_GetPin(Pin);

	if (p < 8) { // check mode in CRL
		mode = port->CRL;
		mode_mask = mode_mask << (p*4);
	}
	else { // check mode in CRH
		mode = port->CRH;
		mode_mask = mode_mask << (p*2);
	}

	if ( (mode & mode_mask) == 0 ) {
		isOutput = FALSE;
	}
	else {
		isOutput = TRUE;
	}
	return isOutput;
}

static inline bool CheckGPIO_PortSource_Pin(GPIO_TypeDef* GPIO_PortSource, GPIO_PIN Pin)
{
	/*if(GPIO_PortSource > GPIO_PortSourceGPIOG)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] GPIO bank number greater than max allowable bank at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}*/

	assert_param(IS_GPIO_ALL_PERIPH(GPIO_PortSource));

	if(Pin > GPIO_PPP)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins per port at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}
	return TRUE;
}

int16_t GPIO_GetExtrCR(UINT32 line)
{
	if(line > (1 << NUMBER_OF_EXTI_LINES))
		return -1;

	for(UINT16 i = 0; i < NUMBER_OF_EXTI_LINES; i++)
	{
		if(line & (1 << i))
			return i;
	}

	return -1;
}

uint16_t GPIO_GetPin(GPIO_PIN Pin) {
	return (uint16_t)(0x1 << (Pin % GPIO_PPP));
}

uint8_t GPIO_GetPort(GPIO_PIN Pin) {
	return (uint8_t)(Pin / GPIO_PPP);
}

UINT32 GPIO_GetExtiLine(GPIO_PIN Pin){
	return EXTILines[Pin % GPIO_PPP];
}

GPIO_TypeDef* GPIO_GetPortPtr(GPIO_PIN Pin) {
	return GPIO_PORT_ARRAY[GPIO_GetPort(Pin)];
}

UINT32 GPIO_GetIRQNumber(GPIO_PIN Pin)
{
	UINT32 line = Pin % GPIO_PPP;
	UINT32 irq_number;

	switch(line)
	{
	case	0:
		irq_number = EXTI0_IRQn;
		break;
	case 	1:
		irq_number = EXTI1_IRQn;
		break;
	case 	2:
		irq_number = EXTI2_IRQn;
		break;
	case    3:
		irq_number = EXTI3_IRQn;
		break;
	case    4:
		irq_number = EXTI4_IRQn;
		break;
	case	5:
	case	6:
	case    7:
	case    8:
	case    9:
		irq_number = EXTI9_5_IRQn;
		break;
	case   10:
	case   11:
	case   12:
	case   13:
	case   14:
	case   15:
		irq_number = EXTI15_10_IRQn;
		break;

	}

	return irq_number;
}

HAL_CALLBACK_FPN GPIO_GetCallBack(GPIO_PIN Pin)
{
	UINT32 line = Pin % GPIO_PPP;
	HAL_CALLBACK_FPN callback;

	switch(line)
	{
	case	0:
		callback = EXTI0_IRQ_HANDLER;
		break;
	case 	1:
		callback = EXTI1_IRQ_HANDLER;
		break;
	case 	2:
		callback = EXTI2_IRQ_HANDLER;
		break;
	case    3:
		callback = EXTI3_IRQ_HANDLER;
		break;
	case    4:
		callback = EXTI4_IRQ_HANDLER;
		break;
	case	5:
	case	6:
	case    7:
	case    8:
	case    9:
		callback = EXTI9_5_IRQ_HANDLER;
		break;
	case   10:
	case   11:
	case   12:
	case   13:
	case   14:
	case   15:
		callback = EXTI15_10_IRQ_Handler;
		break;

	}

	return callback;
}

//Exported Functions


// Initialize the ports GPIOA .... GPIOG of the Emote
BOOL CPU_GPIO_Initialize()
{
	UINT16 port;
	UINT16 pin;
	STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR* pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr;

	if(gpioDriverInitialized)
		return TRUE;

	// Configure clock source for all gpio ports
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | RCC_APB2Periph_GPIOF | RCC_APB2Periph_GPIOG | RCC_APB2Periph_AFIO, ENABLE);
	// Initialize all the pins in all the ports to the following configuration
	// - Input Floating
	// - 2 MHZ (consumes the least power)
	int ik = 0;

	for(port = 0; port < GPIO_PORTS; port++)
	{
		g_STM32F10x_Gpio_Driver.m_pinReservationInfo[port] = 0;
	}

	// Initialize the isr structure for each of the pins
	for(pin = 0; pin < GPIO_PINS; pin++)
	{
		//GPIO_StructInit(&GPIO_Instances[pin]);
		pinIsr->m_pin     = pin;
		pinIsr->m_intEdge = GPIO_INT_NONE;
		pinIsr->m_isr     = STUB_GPIOISRVector;
		pinIsr->m_param   = NULL;

		pinIsr++;

		//CPU_GPIO_EnableOutputPin((GPIO_PIN) pin, FALSE);
	}

	gpioDriverInitialized = TRUE;

	return TRUE;

#if 0
	UINT8 ik;

	for(ik = 0; ik < GPIO_PINS; ik++) {
		GPIO_StructInit(&GPIO_Instances[ik]);
	}

	for(ik = 0; ik < GPIO_PORTS; ik++) {
		GPIO_Reserve[ik] = 0x00000000U;
	}

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO, ENABLE);

	return TRUE;
#endif

}

BOOL CPU_GPIO_Uninitialize()
{
	//GPIOA
	RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOA, DISABLE);
	//GPIOB
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOB, DISABLE);
	//GPIOC
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOC, DISABLE);
	//GPIOD
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOD, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOD, DISABLE);
	//GPIOE
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOE, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOE, DISABLE);
	//GPIOF
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOF, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOF, DISABLE);
	//GPIOG
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOG, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_GPIOG, DISABLE);
	//AFIO
	RCC_APB2PeriphResetCmd(RCC_APB2Periph_AFIO, ENABLE);
	RCC_APB2PeriphResetCmd(RCC_APB2Periph_AFIO, DISABLE);
	return TRUE;
}

BOOL CPU_GPIO_TogglePinState(GPIO_PIN Pin)
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	bool pinState = CPU_GPIO_GetPinState(Pin);

	if(pinState == FALSE)
	{
		CPU_GPIO_SetPinState(Pin, TRUE);
		//pinState = TRUE;
	}
	else
	{
		CPU_GPIO_SetPinState(Pin, FALSE);
		//pinState = FALSE;
	}
}

UINT32 CPU_GPIO_Attributes( GPIO_PIN Pin )
{
	/*if(Pin < GPIO_PINS)
	{
		return g_STM32F10x_Gpio_Driver.c_Gpio_Attributes[Pin];
	}
	
	return GPIO_ATTRIBUTE_NONE;*/
}


void GPIO_ConfigurePin( GPIO_TypeDef* GPIO_PortSource, GPIO_PIN Pin, GPIOMode_TypeDef mode, GPIOSpeed_TypeDef speed)
{
	if(!CheckGPIO_PortSource_Pin(GPIO_PortSource, Pin))
		return;

