Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/gpio/netmf_gpio.cpp
	/*GPIO_PIN Pin;
	Pin = (GPIO_PortSource * GPIO_PPP) + PinTemp;

	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return;
	}*/

	/*GPIO_StructInit(&GPIO_Instances[Pin]);
	GPIO_Instances[Pin].GPIO_Pin = GPIO_GetPin(Pin);
	GPIO_Instances[Pin].GPIO_Mode = mode;
	GPIO_Instances[Pin].GPIO_Speed = speed;
	GPIO_Init(GPIO_GetPortPtr(Pin), &GPIO_Instances[Pin]);*/

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Pin = GPIO_GetPin(Pin);
	GPIO_InitStructure.GPIO_Mode = mode; // output mode
	GPIO_InitStructure.GPIO_Speed = speed;
	GPIO_Init(GPIO_PortSource, &GPIO_InitStructure);
}

void GPIO_ConfigurePin( GPIO_TypeDef* GPIO_PortSource, uint16_t Pin, GPIOMode_TypeDef mode, GPIOSpeed_TypeDef speed)
{
	assert_param(IS_GPIO_ALL_PERIPH(GPIO_PortSource));

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Pin = Pin;
	GPIO_InitStructure.GPIO_Mode = mode; // output mode
	GPIO_InitStructure.GPIO_Speed = speed;
	GPIO_Init(GPIO_PortSource, &GPIO_InitStructure);
}


void CPU_GPIO_DisablePin( GPIO_PIN Pin, GPIO_RESISTOR ResistorState, UINT32 Direction, GPIO_ALT_MODE AltFunction )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return;
	}

	/*GPIO_StructInit(&GPIO_Instances[Pin]);
	GPIO_Instances[Pin].GPIO_Pin = GPIO_GetPin(Pin);
	GPIO_Init(GPIO_GetPortPtr(Pin), &GPIO_Instances[Pin]);*/
	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	GPIO_ConfigurePin(port, pinInHex);
	CPU_GPIO_SetPinState(Pin, FALSE);
}

// Configure the pin as an output pin, strange that this does not have a return type
void CPU_GPIO_EnableOutputPin( GPIO_PIN Pin, BOOL InitialState )
{
	// Check if the input pin is less than max pins
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return;
	}

	/*GPIO_Instances[Pin].GPIO_Pin = GPIO_GetPin(Pin);
	GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIO_GetPortPtr(Pin), &GPIO_Instances[Pin]);*/
	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	GPIO_ConfigurePin(port, pinInHex, GPIO_Mode_Out_PP);
	CPU_GPIO_SetPinState(Pin, InitialState);
}

BOOL CPU_GPIO_EnableInputPin( GPIO_PIN Pin, BOOL GlitchFilterEnable, GPIO_INTERRUPT_SERVICE_ROUTINE PIN_ISR, GPIO_INT_EDGE IntEdge, GPIO_RESISTOR ResistorState )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	return CPU_GPIO_EnableInputPin2(Pin, GlitchFilterEnable, PIN_ISR, NULL, IntEdge, ResistorState );
}

BOOL CPU_GPIO_EnableInputPin3( GPIO_PIN Pin, BOOL GlitchFilterEnable, GPIO_INT_EDGE IntEdge, GPIO_RESISTOR ResistorState )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	/*GPIO_Instances[Pin].GPIO_Pin = GPIO_GetPin(Pin);
	if		(ResistorState == RESISTOR_DISABLED) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IN_FLOATING;
	}else if(ResistorState == RESISTOR_PULLDOWN) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IPD;
	}else if(ResistorState == RESISTOR_PULLUP) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IPU;
	}
	else
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Invalid resistor configuration at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	GPIO_Init(GPIO_GetPortPtr(Pin), &GPIO_Instances[Pin]);*/

	GPIOMode_TypeDef mode;

	if (ResistorState == RESISTOR_DISABLED) {
		mode = GPIO_Mode_IN_FLOATING;
	} else if(ResistorState == RESISTOR_PULLDOWN) {
		mode = GPIO_Mode_IPD;
	} else if(ResistorState == RESISTOR_PULLUP) {
		mode = GPIO_Mode_IPU;
	} else {
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Invalid resistor configuration at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	GPIO_ConfigurePin(port, pinInHex, mode);
	
	return TRUE;
}

BOOL CPU_GPIO_EnableInputPin2( GPIO_PIN Pin, BOOL GlitchFilterEnable, GPIO_INTERRUPT_SERVICE_ROUTINE PIN_ISR, void* ISR_Param, GPIO_INT_EDGE IntEdge, GPIO_RESISTOR ResistorState )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	EXTI_InitTypeDef EXTI_InitStructure;

	/*GPIO_InitTypeDef GPIO_InitStructure;

    GPIO_Instances[Pin].GPIO_Pin = GPIO_GetPin(Pin);
	if		(ResistorState == RESISTOR_DISABLED) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IN_FLOATING;
	}else if(ResistorState == RESISTOR_PULLDOWN) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IPD;
	}else if(ResistorState == RESISTOR_PULLUP) {
		GPIO_Instances[Pin].GPIO_Mode = GPIO_Mode_IPU;
	}
	GPIO_Init(GPIO_GetPortPtr(Pin), &GPIO_Instances[Pin]);*/

	GPIOMode_TypeDef mode;
	if (ResistorState == RESISTOR_DISABLED) {
		mode = GPIO_Mode_IN_FLOATING;
	} else if(ResistorState == RESISTOR_PULLDOWN) {
		mode = GPIO_Mode_IPD;
	} else if(ResistorState == RESISTOR_PULLUP) {
		mode = GPIO_Mode_IPU;
	}

	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	GPIO_ConfigurePin(port, pinInHex, mode);

	// Nived.Sivadas - adding interrupt support to the gpio pins
	GPIO_EXTILineConfig(GPIO_GetPort(Pin), (Pin % GPIO_PPP));

	if(PIN_ISR)
	{
		EXTI_InitStructure.EXTI_Line = GPIO_GetExtiLine(Pin);

		EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;

		if(GPIO_INT_EDGE_LOW == IntEdge)
			EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
		else if(GPIO_INT_EDGE_HIGH == IntEdge)
			EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
		else if(GPIO_INT_EDGE_BOTH == IntEdge)
			EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		// Not supported on the device
		else if(GPIO_INT_LEVEL_HIGH == IntEdge || GPIO_INT_LEVEL_LOW == IntEdge)
			return FALSE;

		// Initialize external interrupts
		EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		EXTI_Init(&EXTI_InitStructure);


		STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[Pin];

		pinIsr.m_isr     = PIN_ISR;
		pinIsr.m_param   = ISR_Param;
		pinIsr.m_intEdge = IntEdge;

		CPU_INTC_ActivateInterrupt(GPIO_GetIRQNumber(Pin), (HAL_CALLBACK_FPN) GPIO_GetCallBack(Pin), NULL);
	}

