Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/gpio/netmf_gpio.cpp
	return TRUE;
}

// Return the state of the pin
// In case the pin is configured as one of the input modes, read the input data register.
// If the pin is configured in one of the output modes, read the output data register
BOOL CPU_GPIO_GetPinState( GPIO_PIN Pin )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	/*if((GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_AIN) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IN_FLOATING) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPD) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPU))
		return (BOOL)GPIO_ReadInputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));
	else
		return (BOOL)GPIO_ReadOutputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));*/

	/*if((GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_AIN) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IN_FLOATING) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPD) || (GPIO_Instances[Pin].GPIO_Mode == GPIO_Mode_IPU))
		return (BOOL)GPIO_ReadInputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));
	else
		return (BOOL)GPIO_ReadOutputDataBit(GPIO_GetPortPtr(Pin), GPIO_GetPin(Pin));*/

	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	if(IsOutputPin(Pin)){
		return (BOOL)GPIO_ReadOutputDataBit(port, pinInHex);
	} else	{
		return (BOOL)GPIO_ReadInputDataBit(port, pinInHex);
	}
}

void CPU_GPIO_SetPinState( GPIO_PIN Pin, BOOL PinState )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return;
	}

	//If it isn't an output pin, then its not valid to Set(). EnableOutputPin() first.
	//If you call Set() and it isn't an output, nothing will happen.
	//if (!IsOutputPin(Pin)) { return; }

	GPIO_TypeDef* port = GPIO_GetPortPtr(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
	if(PinState) {
		GPIO_WriteBit(port, pinInHex, Bit_SET);
	} else {
		GPIO_WriteBit(port, pinInHex, Bit_RESET);
	}
}


/*void CPU_GPIO_SetPinState( uint8_t GPIO_PortSource, GPIO_PIN Pin, BOOL PinState )
{
	if(!CheckGPIO_PortSource_Pin(GPIO_PortSource, Pin))
		return;

	if(PinState) {
		GPIO_WriteBit(GPIO_PORT_ARRAY[GPIO_PortSource], GPIO_GetPin(Pin), Bit_SET);
	} else {
		GPIO_WriteBit(GPIO_PORT_ARRAY[GPIO_PortSource], GPIO_GetPin(Pin), Bit_RESET);
	}
}*/


// Check if the pin is busy or in use, takes the Pin number as the input argument
BOOL CPU_GPIO_PinIsBusy( GPIO_PIN Pin )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	uint8_t port = GPIO_GetPort(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
    return  ((g_STM32F10x_Gpio_Driver.m_pinReservationInfo[port] & pinInHex) > 0 ? TRUE : FALSE);
    //return  ((g_STM32F10x_Gpio_Driver.m_pinReservationInfo[GPIO_PortSource] & GPIO_GetPin(Pin)) > 0 ? TRUE : FALSE);
}

// This function is used to reserve and unreserve pins to avoid gpio resource conflict issues
BOOL CPU_GPIO_ReservePin( GPIO_PIN Pin, BOOL fReserve )
{
	if(Pin > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] Pin Number greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return FALSE;
	}

	// Check if the pin you are about to configure is busy or already in use, if so return false
	if(CPU_GPIO_PinIsBusy(Pin) && fReserve)
	{
		GPIO_DEBUG_PRINT1("[Native] [GPIO Driver] The Pin is busy\n");
		return FALSE;
	}

	uint8_t port = GPIO_GetPort(Pin);
	uint16_t pinInHex = GPIO_GetPin(Pin);
    if(fReserve) {
		SET_BIT(g_STM32F10x_Gpio_Driver.m_pinReservationInfo[port], pinInHex);
	} else {
		CLEAR_BIT(g_STM32F10x_Gpio_Driver.m_pinReservationInfo[port], pinInHex);
	}

    /*if(fReserve) {
		SET_BIT(g_STM32F10x_Gpio_Driver.m_pinReservationInfo[GPIO_PortSource], GPIO_GetPin(Pin));
	} else {
		CLEAR_BIT(g_STM32F10x_Gpio_Driver.m_pinReservationInfo[GPIO_PortSource], GPIO_GetPin(Pin));
	}*/

    return TRUE;
}

//STUB
UINT32 CPU_GPIO_GetDebounce()
{
    return 0;
}

//STUB
BOOL CPU_GPIO_SetDebounce( INT64 debounceTimeMilliseconds )
{
    return FALSE;
}

INT32 CPU_GPIO_GetPinCount()
{
    return GPIO_PINS;
} 

void CPU_GPIO_GetPinsMap( UINT8* pins, size_t size )
{
	if(size > GPIO_PINS)
	{
		GPIO_DEBUG_PRINT2("[Native] [GPIO Driver] size greater than max allowable pins at %s, %s \n", __LINE__, __FILE__);
		return;
	}
    UINT8 ik;
	for(ik = 0; ik < size; ik++) {
		//pins[ik] = (UINT8)CPU_GPIO_Attributes((GPIO_PIN)ik);
		pins[ik] = GPIO_ATTRIBUTE_INPUT | GPIO_ATTRIBUTE_OUTPUT;
	}
}

UINT8 CPU_GPIO_GetSupportedResistorModes( GPIO_PIN Pin )
{
	return g_STM32F10x_Gpio_Driver.c_GPIO_ResistorMode;
}

UINT8 CPU_GPIO_GetSupportedInterruptModes( GPIO_PIN pin )
{
    return g_STM32F10x_Gpio_Driver.c_GPIO_InterruptMode;
}




extern "C"
{

void Default_EXTI_Handler(void *data)
{

}

void EXTI0_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line0) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line0);

		UINT32 line = GPIO_GetExtrCR(EXTI_Line0);
		UINT32 port = ((AFIO->EXTICR[line >> 2]) >> ( 4 * (line % 4))) & 0x7;
		UINT32 pin = line + port * GPIO_PPP;

		STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];

		if(pinIsr.m_isr)
			pinIsr.m_isr(pin, GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin),GPIO_GetPin(pin)),  pinIsr.m_param);
	}
}

void EXTI1_IRQ_HANDLER(void *args)
{
	if(EXTI_GetITStatus(EXTI_Line1) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line1);

		UINT32 line = GPIO_GetExtrCR(EXTI_Line1);
		UINT32 port = ((AFIO->EXTICR[line >> 2]) >> ( 4 * (line % 4))) & 0x7;
		UINT32 pin = line + port * GPIO_PPP;

		STM32F10x_GPIO_Driver::PIN_ISR_DESCRIPTOR& pinIsr = g_STM32F10x_Gpio_Driver.m_pinIsr[pin];

		if(pinIsr.m_isr)
			pinIsr.m_isr(pin, GPIO_ReadInputDataBit(GPIO_GetPortPtr(pin),GPIO_GetPin(pin)),  pinIsr.m_param);
	}
}

void EXTI2_IRQ_HANDLER(void *args)
{
	int line = 0;

	if(EXTI_GetITStatus(EXTI_Line2) != RESET)
	{
		EXTI_ClearITPendingBit(EXTI_Line2);

